config/config_long_test.yaml
# NFS Performance Long Test Configuration
# Designed to complete in approximately 4-8 hours
# Comprehensive benchmark testing with extensive data sizes and long runtimes
# This is the actual benchmark test for production performance analysis

# DD Test Configuration
dd_tests:
  enabled: true
  
  sequential_write_direct:
    enabled: true
    block_size: "1M"
    count: 5000               # 5GB - sanity test (fixed size)
    flags:
      direct: true
      sync: false
  
  sequential_write_sync:
    enabled: true
    block_size: "1M"
    count: 5000               # 5GB - sanity test (fixed size)
    flags:
      direct: false
      sync: true
  
  sequential_read_direct:
    enabled: true
    block_size: "1M"
    count: 5000               # 5GB - sanity test (fixed size)
    flags:
      direct: true
  
  sequential_read_cached:
    enabled: true
    block_size: "1M"
    count: 5000               # 5GB - sanity test (fixed size)
    flags:
      direct: false

# IOzone Test Configuration (Long Test Profile)
iozone_tests:
  enabled: true
  
  baseline_throughput:
    enabled: true
    file_size: "32g"             # Large file for benchmark
    record_size: "1m"
    test_types: [0, 1]
    direct_io: true
    include_close: true
  
  cache_behavior:
    enabled: true
    file_size: "16g"             # Large file for cache analysis
    record_size: "1m"
    test_types: [0, 1]           # 0=write to create file, 1=read for cache test
    direct_io: false
  
  random_io_4k:
    enabled: true
    file_size: "8g"              # Large file for random I/O
    record_size: "4k"
    test_types: [0, 2, 4]        # 0=write to create file, 2=random read, 4=random write
    direct_io: true
  
  concurrency_16_threads:
    enabled: true
    file_size: "4g"              # Large file per thread
    record_size: "1m"
    threads: 64                  # High concurrency
    test_types: [0, 1]
    direct_io: true
    throughput_mode: true
  
  metadata_operations:
    enabled: true
    file_size: "256m"            # Larger files for metadata
    record_size: "4k"
    threads: 128                 # Very high thread count
    test_types: [0, 1]
    direct_io: false
    throughput_mode: true
  
  scaling_test:
    enabled: true
    thread_counts: [4, 8, 16, 32, 64, 128]  # Extended scaling range
    file_size: "4g"              # Large file per thread
    record_size: "1m"
    test_types: [0, 1]
    direct_io: true
    throughput_mode: true
  
  mixed_workload:
    enabled: true
    file_size: "16g"             # Large mixed workload
    record_size: "128k"
    threads: 32                  # High concurrency
    test_types: [0, 1, 2, 4]
    direct_io: true
    throughput_mode: true

# FIO Test Configuration
fio_tests:
  enabled: true
  
  common:
    output_format: "json"
    time_based: true
    group_reporting: true
  
  sequential_write:
    enabled: true
    rw: "write"
    bs: "1M"
    size: "32G"               # Large file for benchmark
    numjobs: 1
    ioengine: "libaio"
    iodepth: 16
    direct: 1
    runtime: 1800             # 30 minutes
  
  sequential_read:
    enabled: true
    rw: "read"
    bs: "1M"
    size: "32G"               # Large file for benchmark
    numjobs: 4
    ioengine: "libaio"
    iodepth: 16
    direct: 1
    runtime: 1800             # 30 minutes
  
  random_read_4k:
    enabled: true
    rw: "randread"
    bs: "4k"
    size: "16G"               # Large dataset for IOPS
    numjobs: 8
    ioengine: "libaio"
    iodepth: 32
    direct: 1
    runtime: 3600             # 60 minutes
    randrepeat: 0
  
  random_write_4k:
    enabled: true
    rw: "randwrite"
    bs: "4k"
    size: "16G"               # Large dataset for IOPS
    numjobs: 8
    ioengine: "libaio"
    iodepth: 32
    direct: 1
    runtime: 3600             # 60 minutes
    randrepeat: 0
  
  mixed_randrw_70_30:
    enabled: true
    rw: "randrw"
    rwmixread: 70
    bs: "8k"
    size: "16G"               # Large dataset for mixed workload
    numjobs: 16
    ioengine: "libaio"
    iodepth: 16
    direct: 1
    runtime: 3600             # 60 minutes
    randrepeat: 0
  
  metadata_operations:
    enabled: true
    rw: "write"
    bs: "4k"
    filesize: "1M"
    nrfiles: 50000            # Large number of files
    numjobs: 16
    ioengine: "sync"
    create_on_open: 1
    runtime: 1800             # 30 minutes
  
  latency_test:
    enabled: true
    rw: "randread"
    bs: "4k"
    size: "8G"                # Large dataset for latency
    numjobs: 1
    ioengine: "libaio"
    iodepth: 1
    direct: 1
    runtime: 1800             # 30 minutes
    lat_percentiles: 1

# Bonnie++ Test Configuration (Long Test Profile)
bonnie_tests:
  enabled: true
  
  comprehensive_test:
    enabled: true
    file_size: "64g"             # Very large file for benchmark
    ram_size: "16384"            # Tell bonnie++ to assume 16GB RAM
    num_files: "128:0:0:128"     # Many files for metadata
    timeout: 14400               # 4 hours
  
  fast_test:
    enabled: true
    file_size: "32g"             # Large file for fast test
    ram_size: "8192"             # Tell bonnie++ to assume 8GB RAM
    num_files: "64:0:0:64"
    fast_mode: true
    timeout: 7200                # 2 hours
  
  file_operations:
    enabled: true
    file_size: "16g"             # Large file for operations
    ram_size: "4096"             # Tell bonnie++ to assume 4GB RAM
    num_files: "256:0:0:256"     # Many files for extensive metadata testing
    # processes: 8               # Disabled - causes issues with CSV output in some bonnie++ versions
# dbench Test Configuration (Long Test Profile)
# Estimated time: ~2-3 hours
dbench_tests:
  enabled: true
  
  common:
    directory: "dbench_test"
    warmup: 60                    # Extended warmup
    machine_readable: true
    skip_cleanup: false
    fsync: false
    sync_dirs: false
  
  light_client_load:
    enabled: true
    num_clients: 2
    duration: 600                 # 10 minutes
    loadfile: "nfs_3.load"
    target_rate: 0
  
  moderate_client_load:
    enabled: true
    num_clients: 16               # Moderate concurrency
    duration: 1800                # 30 minutes
    loadfile: "nfs_3.load"
    target_rate: 0
  
  heavy_client_load:
    enabled: true
    num_clients: 64               # High concurrency
    duration: 1800                # 30 minutes
    loadfile: "nfs_3.load"
    target_rate: 0
  
  scalability_test:
    enabled: true
    client_counts: [1, 2, 4, 8, 16, 32, 64, 128]  # Extended range
    duration_per_count: 600       # 10 minutes per count
    loadfile: "nfs_3.load"
    target_rate: 0
  
  latency_test:
    enabled: true
    num_clients: 1
    duration: 1800                # 30 minutes
    loadfile: "nfs_3.load"
    # Note: fsync and sync_dirs not supported by dbench 5.0
    target_rate: 0
  
  sustained_load:
    enabled: true
    num_clients: 32               # Sustained high load
    duration: 7200                # 2 hours
    loadfile: "nfs_3.load"
    target_rate: 0
    warmup: 300                   # 5 minute warmup
  
  rate_limited_test:
    enabled: true
    num_clients: 16
    duration: 1800                # 30 minutes
    loadfile: "nfs_3.load"
    target_rate: 200              # 200 MB/s target
  
  metadata_intensive:
    enabled: true
    num_clients: 128              # Very high concurrency
    duration: 1800                # 30 minutes
    loadfile: "nfs_3.load"
    target_rate: 0

    timeout: 10800               # 3 hours

# Test Execution Options
execution:
  stop_on_error: false
  cleanup_on_completion: true
  verbose: false

# Output Options
output:
  json_enabled: true
  log_enabled: true
  console_summary: true

# Performance Baselines (for reference)
baselines:
  network_10gbe:
    sequential_read_mbps: [900, 1150]
    sequential_write_mbps: [700, 1000]
    random_read_iops: [20000, 40000]
    random_write_iops: [15000, 30000]
    latency_avg_ms: [1, 2]

# Long Test Profile - ACTUAL BENCHMARK TEST
# Estimated completion time: 4-8 hours
#
# Test Duration Breakdown:
# - DD Tests: ~5 minutes (4 tests × 5GB each - sanity check)
# - FIO Tests: ~4.5 hours (sequential: 1 hour, random: 2 hours, mixed: 1 hour, metadata: 30 min, latency: 30 min)
# - IOzone Tests: ~1-2 hours (varies by test type and file size)
# - Bonnie++ Tests: ~6-8 hours (comprehensive: 4 hours, fast: 2 hours, file ops: 1-2 hours)
# - dbench Tests: ~2-3 hours (scalability + sustained load)
#
# Total Data Written: ~500GB-1TB (depending on test completion)
#
# This configuration provides:
# - Statistical significance through extended runtimes
# - Comprehensive performance characterization
# - Stress testing under sustained load
# - Detailed scalability analysis
# - Production-grade benchmark results

# Made with Bob